matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
# 1 "/var/folders/0j/hvjx5qzd797ck95vn2h68xr40000gn/T/tmp585025pt"
#include <Arduino.h>
# 1 "/Users/mattie/Documents/PlatformIO/Projects/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino"
#include <WiFi.h>
#include <WiFiManager.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include <esp_err.h>
#include "driver/i2s.h"
#include <Preferences.h>
#include <math.h>
#include <FastLED.h>
#include "WebUI.h"







WiFiClient* volatile streamClient = NULL;

enum RtspTransportMode : uint8_t {
    RTSP_TRANSPORT_TCP_INTERLEAVED = 0,
    RTSP_TRANSPORT_UDP_UNICAST = 1,
};
TaskHandle_t audioCaptureTaskHandle = NULL;
volatile bool audioTaskRunning = false;


portMUX_TYPE logMux = portMUX_INITIALIZER_UNLOCKED;
volatile bool stopStreamRequested = false;
volatile bool streamCleanupDone = false;
SemaphoreHandle_t taskExitSemaphore = NULL;
volatile bool core1OwnsLED = false;


#define FW_VERSION "2.6.3"

const char* FW_VERSION_STR = FW_VERSION;
static const uint16_t OTA_PORT = 3232;


#define DEFAULT_SAMPLE_RATE 16000
#define DEFAULT_GAIN_FACTOR 1.0f
#define DEFAULT_BUFFER_SIZE 1024
#define DEFAULT_WIFI_TX_DBM 19.5f
#define DEFAULT_NETWORK_HOSTNAME "atoms3mic"

#define DEFAULT_HPF_ENABLED true
#define DEFAULT_HPF_CUTOFF_HZ 450


#define DEFAULT_OVERHEAT_PROTECTION true
#define DEFAULT_OVERHEAT_LIMIT_C 80
#define OVERHEAT_MIN_LIMIT_C 30
#define OVERHEAT_MAX_LIMIT_C 95
#define OVERHEAT_LIMIT_STEP_C 5



#define I2S_CLK_PIN 1
#define I2S_DATA_IN_PIN 2
#define WS2812_LED_PIN 35

static CRGB statusLed[1];
inline void setStatusLed(const CRGB& color);
const char* currentRtspTransportName();
static String extractRtspHeader(const String &request, const char* headerName);
static bool parseRtspClientPorts(const String &transportHeader, uint16_t &rtpPort, uint16_t &rtcpPort);
float wifiPowerLevelToDbm(wifi_power_t lvl);
static wifi_power_t pickWifiPowerLevel(float dbm);
String describeHardwareProfile();
String describeFilterChain();
static void fillConcealmentBlock(int16_t* buffer, uint16_t samples, int16_t lastSample);
void recordTelemetrySample(float cpuLoadPct, float tempC, bool tempValid);
void updateHighpassCoeffs();
String formatUptime(unsigned long seconds);
String formatSince(unsigned long eventMs);
static bool isTemperatureValid(float temp);
static void persistOverheatNote();
void recordOverheatTrip(float temp);
void checkTemperature();
void checkPerformance();
void checkWiFiHealth();
void checkScheduledReset();
void loadAudioSettings();
void saveAudioSettings();
void scheduleReboot(bool factoryReset, uint32_t delayMs);
uint16_t effectiveAudioChunkSize();
static uint16_t computeI2sDmaBufferLen();
static uint8_t computeI2sDmaBufferCount();
static uint16_t computeI2sReadBufferSamples();
uint32_t computeRecommendedMinRate();
void resetToDefaultSettings();
void restartI2S();
static String logTimestamp();
void simplePrint(String message);
void simplePrintln(String message);
static void resumeRtspServerAfterOtaFailure();
static void setupArduinoOta();
void drainRtspReceiveBuffer(WiFiClient &client);
static void updateFftFromBlock(const int16_t* samples, uint16_t count);
void audioCaptureTask(void* parameter);
void startAudioCaptureTask();
void stopAudioCaptureTask();
bool requestStreamStop(const char* reason);
void setup_i2s_driver();
static bool writeAll(WiFiClient &client, const uint8_t* data, size_t len, unsigned long timeoutMs);
static bool writeRtspSimpleResponse(WiFiClient &client, int cseqVal, const char* extraHeaders);
void sendRTPPacket(WiFiClient &client, int16_t* audioData, int numSamples);
void handleRTSPCommand(WiFiClient &client, String request);
void processRTSP(WiFiClient &client);
static void rejectBusyRtspClient(WiFiClient &client);
void setup();
void loop();
#line 66 "/Users/mattie/Documents/PlatformIO/Projects/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino"
inline void setStatusLed(const CRGB& color) {
    statusLed[0] = color;
    FastLED.show();
}


WiFiServer rtspServer(8554);
WiFiClient rtspClient;
String networkHostname = DEFAULT_NETWORK_HOSTNAME;
bool otaPreviousRtspEnabled = true;


String rtspSessionId = "";
volatile bool isStreaming = false;
uint16_t rtpSequence = 0;
uint32_t rtpTimestamp = 0;
uint32_t rtpSSRC = 0x43215678;
unsigned long lastRTSPActivity = 0;
RtspTransportMode activeRtspTransport = RTSP_TRANSPORT_TCP_INTERLEAVED;
WiFiUDP rtpUdp;
IPAddress rtspUdpClientIp;
uint16_t rtspUdpClientRtpPort = 0;
uint16_t rtspUdpClientRtcpPort = 0;
static const uint16_t RTP_UDP_SERVER_PORT = 6970;
static const uint16_t RTCP_UDP_SERVER_PORT = 6971;

static int parseRtspCSeqValue(const char* request);
static uint16_t parseRtspContentLengthValue(const char* request);
static bool writeRtspSimpleResponse(WiFiClient &client, int cseqVal, const char* extraHeaders = NULL);
static bool handleStreamingRtspCommand(WiFiClient &client, const char* request);
static void pollStreamingRtspCommands(WiFiClient &client, char* rtspBuf, size_t rtspBufSize,
                                      size_t &rtspBufPos, uint16_t &interleavedDiscardRemaining);


uint8_t rtspParseBuffer[1024];
int rtspParseBufferPos = 0;



unsigned long audioPacketsSent = 0;
unsigned long audioPacketsDropped = 0;
unsigned long lastStatsReset = 0;
bool rtspServerEnabled = true;


uint32_t currentSampleRate = DEFAULT_SAMPLE_RATE;
float currentGainFactor = DEFAULT_GAIN_FACTOR;
uint16_t currentBufferSize = DEFAULT_BUFFER_SIZE;



uint8_t i2sShiftBits = 0;


uint16_t lastPeakAbs16 = 0;
uint32_t audioClipCount = 0;
bool audioClippedLastBlock = false;
uint16_t peakHoldAbs16 = 0;
unsigned long peakHoldUntilMs = 0;


volatile uint32_t i2sReadOkCount = 0;
volatile uint32_t i2sReadErrCount = 0;
volatile uint32_t i2sReadZeroCount = 0;
volatile uint16_t i2sLastSamplesRead = 0;
volatile int16_t i2sLastRawMin = 0;
volatile int16_t i2sLastRawMax = 0;
volatile uint16_t i2sLastRawPeakAbs = 0;
volatile uint16_t i2sLastRawRms = 0;
volatile uint16_t i2sLastRawZeroPct = 0;
volatile bool i2sLikelyUnsignedPcm = false;
volatile bool i2sDriverOk = false;
volatile int32_t i2sLastError = ESP_OK;
volatile uint32_t audioFallbackBlockCount = 0;
volatile uint32_t i2sLastGapMs = 0;
volatile float audioPipelineLoadPct = 0.0f;


volatile uint8_t fftBins[32] = {0};
volatile uint32_t fftFrameSeq = 0;


portMUX_TYPE webAudioMux = portMUX_INITIALIZER_UNLOCKED;
volatile uint32_t webAudioFrameSeq = 0;
volatile uint16_t webAudioFrameSamples[WEBUI_AUDIO_RING_LEN] = {0};
volatile uint32_t webAudioSampleRate[WEBUI_AUDIO_RING_LEN] = {0};
volatile uint32_t webAudioRingSeq[WEBUI_AUDIO_RING_LEN] = {0};
int16_t webAudioFrame[WEBUI_AUDIO_RING_LEN][WEBUI_AUDIO_MAX_SAMPLES] = {{0}};


