matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
portMUX_TYPE telemetryMux = portMUX_INITIALIZER_UNLOCKED;
static const uint16_t TELEMETRY_HISTORY_LEN = 120;
volatile uint32_t telemetryHistorySeq = 0;
uint8_t telemetryCpuLoadPct[TELEMETRY_HISTORY_LEN] = {0};
int16_t telemetryTempDeciC[TELEMETRY_HISTORY_LEN] = {0};
uint16_t telemetryHistoryHead = 0;
uint16_t telemetryHistoryCount = 0;


uint8_t ledMode = 1;


bool agcEnabled = false;
volatile float agcMultiplier = 1.0f;
const float AGC_TARGET_RMS = 0.10f;
const float AGC_MIN_MULT = 0.1f;
const float AGC_MAX_MULT = 6.0f;
const float AGC_ATTACK_RATE = 0.05f;
const float AGC_RELEASE_RATE = 0.001f;



volatile bool noiseFilterEnabled = false;
volatile float noiseFloorDbfs = -90.0f;
volatile float noiseGateDbfs = -90.0f;
volatile float noiseReductionDb = 0.0f;
const float NOISE_FLOOR_INIT = 300.0f;
const float NOISE_FLOOR_FAST = 0.015f;
const float NOISE_FLOOR_SLOW = 0.0008f;
const float NOISE_GATE_RATIO = 2.6f;
const float NOISE_GATE_MARGIN = 220.0f;
const float NOISE_GATE_MIN = 220.0f;
const float NOISE_GATE_MAX = 5200.0f;
const float NOISE_GATE_CLOSE_RATIO = 0.72f;
const float NOISE_FILTER_MIN_GAIN = 0.55f;
const float NOISE_FILTER_ATTACK = 0.006f;
const float NOISE_FILTER_RELEASE = 0.0008f;
const float NOISE_FILTER_REOPEN = 0.0035f;
const float NOISE_ENV_ATTACK = 0.010f;
const float NOISE_ENV_RELEASE = 0.0012f;
const uint16_t NOISE_GATE_HOLD_MS = 120;
const char* DEVICE_TITLE = "M5 Atom RTSP Microphone";
const char* DEVICE_INPUT_PROFILE = "PDM input profile (AtomS3 Lite + Unit Mini PDM tuned)";
const char* FILTER_CHAIN_BASE = "Signed PDM PCM -> 2nd-order Butterworth high-pass -> optional noise bed suppressor -> manual gain -> limiter -> optional AGC";


struct Biquad {
    float b0{1.0f}, b1{0.0f}, b2{0.0f}, a1{0.0f}, a2{0.0f};
    float x1{0.0f}, x2{0.0f}, y1{0.0f}, y2{0.0f};
    inline float process(float x) {
        float y = b0 * x + b1 * x1 + b2 * x2 - a1 * y1 - a2 * y2;
        x2 = x1; x1 = x; y2 = y1; y1 = y;
        return y;
    }
    inline void reset() { x1 = x2 = y1 = y2 = 0.0f; }
};
bool highpassEnabled = DEFAULT_HPF_ENABLED;
uint16_t highpassCutoffHz = DEFAULT_HPF_CUTOFF_HZ;
Biquad hpf;
uint32_t hpfConfigSampleRate = 0;
uint16_t hpfConfigCutoff = 0;


Preferences audioPrefs;


unsigned long lastMemoryCheck = 0;
unsigned long lastPerformanceCheck = 0;
unsigned long lastWiFiCheck = 0;
unsigned long lastTempCheck = 0;
unsigned long lastTelemetrySampleMs = 0;
uint32_t minFreeHeap = 0xFFFFFFFF;
uint32_t maxPacketRate = 0;
uint32_t minPacketRate = 0xFFFFFFFF;
bool autoRecoveryEnabled = false;
bool autoThresholdEnabled = true;

volatile bool scheduledFactoryReset = false;
volatile unsigned long scheduledRebootAt = 0;
unsigned long bootTime = 0;
unsigned long lastI2SReset = 0;
float maxTemperature = 0.0f;
float lastTemperatureC = 0.0f;
bool lastTemperatureValid = false;
bool overheatProtectionEnabled = DEFAULT_OVERHEAT_PROTECTION;
float overheatShutdownC = (float)DEFAULT_OVERHEAT_LIMIT_C;
bool overheatLockoutActive = false;
float overheatTripTemp = 0.0f;
unsigned long overheatTriggeredAt = 0;
String overheatLastReason = "";
String overheatLastTimestamp = "";
bool overheatSensorFault = false;
bool overheatLatched = false;


bool scheduledResetEnabled = false;
uint32_t resetIntervalHours = 24;


uint32_t minAcceptableRate = 50;
uint32_t performanceCheckInterval = 15;
uint8_t cpuFrequencyMhz = 160;


float wifiTxPowerDbm = DEFAULT_WIFI_TX_DBM;
wifi_power_t currentWifiPowerLevel = WIFI_POWER_19_5dBm;


unsigned long lastRtspClientConnectMs = 0;
unsigned long lastRtspPlayMs = 0;
uint32_t rtspConnectCount = 0;
uint32_t rtspPlayCount = 0;



static const char* rtspTransportModeName(RtspTransportMode mode) {
    switch (mode) {
        case RTSP_TRANSPORT_UDP_UNICAST: return "udp";
        case RTSP_TRANSPORT_TCP_INTERLEAVED:
        default: return "tcp";
    }
}

const char* currentRtspTransportName() {
    return rtspTransportModeName(activeRtspTransport);
}

static String extractRtspHeader(const String &request, const char* headerName) {
    String needle = String("\r\n") + headerName;
    int start = request.indexOf(needle);
    if (start < 0 && request.startsWith(String(headerName))) {
        start = 0;
    } else if (start >= 0) {
        start += 2;
    }
    if (start < 0) return String("");
    int colon = request.indexOf(':', start);
    if (colon < 0) return String("");
    int end = request.indexOf("\r\n", colon);
    if (end < 0) end = request.length();
    String value = request.substring(colon + 1, end);
    value.trim();
    return value;
}

static bool parseRtspClientPorts(const String &transportHeader, uint16_t &rtpPort, uint16_t &rtcpPort) {
    int idx = transportHeader.indexOf("client_port=");
    if (idx < 0) return false;
    idx += 12;
    int end = idx;
    while (end < transportHeader.length()) {
        char c = transportHeader[end];
        if ((c < '0' || c > '9') && c != '-') break;
        end++;
    }
    String ports = transportHeader.substring(idx, end);
    int dash = ports.indexOf('-');
    if (dash < 0) return false;
    int p0 = ports.substring(0, dash).toInt();
    int p1 = ports.substring(dash + 1).toInt();
    if (p0 <= 0 || p0 > 65535 || p1 <= 0 || p1 > 65535) return false;
    rtpPort = (uint16_t)p0;
    rtcpPort = (uint16_t)p1;
    return true;
}


float wifiPowerLevelToDbm(wifi_power_t lvl) {
    switch (lvl) {
        case WIFI_POWER_19_5dBm: return 19.5f;
        case WIFI_POWER_19dBm: return 19.0f;
        case WIFI_POWER_18_5dBm: return 18.5f;
        case WIFI_POWER_17dBm: return 17.0f;
        case WIFI_POWER_15dBm: return 15.0f;
        case WIFI_POWER_13dBm: return 13.0f;
        case WIFI_POWER_11dBm: return 11.0f;
        case WIFI_POWER_8_5dBm: return 8.5f;
        case WIFI_POWER_7dBm: return 7.0f;
        case WIFI_POWER_5dBm: return 5.0f;
        case WIFI_POWER_2dBm: return 2.0f;
        case WIFI_POWER_MINUS_1dBm: return -1.0f;
        default: return 19.5f;
    }
}


static wifi_power_t pickWifiPowerLevel(float dbm) {
    if (dbm <= -1.0f) return WIFI_POWER_MINUS_1dBm;
    if (dbm <= 2.0f) return WIFI_POWER_2dBm;
    if (dbm <= 5.0f) return WIFI_POWER_5dBm;
    if (dbm <= 7.0f) return WIFI_POWER_7dBm;
    if (dbm <= 8.5f) return WIFI_POWER_8_5dBm;
    if (dbm <= 11.0f) return WIFI_POWER_11dBm;
    if (dbm <= 13.0f) return WIFI_POWER_13dBm;
    if (dbm <= 15.0f) return WIFI_POWER_15dBm;
    if (dbm <= 17.0f) return WIFI_POWER_17dBm;
    if (dbm <= 18.5f) return WIFI_POWER_18_5dBm;
    if (dbm <= 19.0f) return WIFI_POWER_19dBm;
    return WIFI_POWER_19_5dBm;
}



