matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
void saveAudioSettings() {
    audioPrefs.begin("audio", false);
    audioPrefs.putUInt("sampleRate", currentSampleRate);
    audioPrefs.putFloat("gainFactor", currentGainFactor);
    audioPrefs.putUShort("bufferSize", currentBufferSize);
    audioPrefs.putUChar("shiftBits", i2sShiftBits);
    audioPrefs.putBool("autoRecovery", autoRecoveryEnabled);
    audioPrefs.putBool("schedReset", scheduledResetEnabled);
    audioPrefs.putUInt("resetHours", resetIntervalHours);
    audioPrefs.putUInt("minRate", minAcceptableRate);
    audioPrefs.putUInt("checkInterval", performanceCheckInterval);
    audioPrefs.putBool("thrAuto", autoThresholdEnabled);
    audioPrefs.putUChar("cpuFreq", cpuFrequencyMhz);
    audioPrefs.putFloat("wifiTxDbm", wifiTxPowerDbm);
    audioPrefs.putBool("hpEnable", highpassEnabled);
    audioPrefs.putUInt("hpCutoff", (uint32_t)highpassCutoffHz);
    audioPrefs.putBool("agcEnable", agcEnabled);
    audioPrefs.putBool("noiseFilter", noiseFilterEnabled);
    audioPrefs.putUChar("ledMode", ledMode);
    audioPrefs.putBool("ohEnable", overheatProtectionEnabled);
    uint32_t ohLimit = (uint32_t)(overheatShutdownC + 0.5f);
    if (ohLimit < OVERHEAT_MIN_LIMIT_C) ohLimit = OVERHEAT_MIN_LIMIT_C;
    if (ohLimit > OVERHEAT_MAX_LIMIT_C) ohLimit = OVERHEAT_MAX_LIMIT_C;
    audioPrefs.putUInt("ohThresh", ohLimit);
    audioPrefs.putString("ohReason", overheatLastReason);
    audioPrefs.putString("ohStamp", overheatLastTimestamp);
    audioPrefs.putFloat("ohTripC", overheatTripTemp);
    audioPrefs.putBool("ohLatched", overheatLatched);
    audioPrefs.end();

    simplePrintln("Settings saved to flash");
}


void scheduleReboot(bool factoryReset, uint32_t delayMs) {
    scheduledFactoryReset = factoryReset;
    scheduledRebootAt = millis() + delayMs;
}




uint16_t effectiveAudioChunkSize() {
    uint16_t chunk = currentBufferSize;
    if (chunk < 256) chunk = 256;
    if (chunk > 1024) chunk = 1024;
    return chunk;
}

static uint16_t computeI2sDmaBufferLen() {



    uint16_t dmaBufLen = (uint16_t)(effectiveAudioChunkSize() / 4U);

    if (currentSampleRate >= 48000) {
        if (dmaBufLen < 256) dmaBufLen = 256;
    } else if (currentSampleRate >= 32000) {
        if (dmaBufLen < 192) dmaBufLen = 192;
    } else if (dmaBufLen < 128) {
        dmaBufLen = 128;
    }

    if (dmaBufLen > 512) dmaBufLen = 512;
    return dmaBufLen;
}

static uint8_t computeI2sDmaBufferCount() {
    return 8;
}

static uint16_t computeI2sReadBufferSamples() {




    uint32_t readSamples = effectiveAudioChunkSize();
    if (currentSampleRate >= 48000) {
        if (readSamples < 512) readSamples = 512;
    } else if (currentSampleRate >= 32000) {
        if (readSamples < 384) readSamples = 384;
    } else if (readSamples < 256) {
        readSamples = 256;
    }
    if (readSamples > WEBUI_AUDIO_MAX_SAMPLES) readSamples = WEBUI_AUDIO_MAX_SAMPLES;
    return (uint16_t)readSamples;
}


uint32_t computeRecommendedMinRate() {
    uint32_t buf = max((uint16_t)1, effectiveAudioChunkSize());
    float expectedPktPerSec = (float)currentSampleRate / (float)buf;
    uint32_t rec = (uint32_t)(expectedPktPerSec * 0.5f + 0.5f);
    if (rec < 5) rec = 5;
    return rec;
}


void resetToDefaultSettings() {
    simplePrintln("FACTORY RESET: Restoring default settings...");


    audioPrefs.begin("audio", false);
    audioPrefs.clear();
    audioPrefs.end();


    currentSampleRate = DEFAULT_SAMPLE_RATE;
    currentGainFactor = DEFAULT_GAIN_FACTOR;
    currentBufferSize = DEFAULT_BUFFER_SIZE;
    i2sShiftBits = 0;

    autoRecoveryEnabled = false;
    autoThresholdEnabled = true;
    scheduledResetEnabled = false;
    resetIntervalHours = 24;
    minAcceptableRate = computeRecommendedMinRate();
    performanceCheckInterval = 15;
    cpuFrequencyMhz = 160;
    wifiTxPowerDbm = DEFAULT_WIFI_TX_DBM;
    highpassEnabled = DEFAULT_HPF_ENABLED;
    highpassCutoffHz = DEFAULT_HPF_CUTOFF_HZ;
    agcEnabled = false;
    agcMultiplier = 1.0f;
    noiseFilterEnabled = false;
    noiseFloorDbfs = -90.0f;
    noiseGateDbfs = -90.0f;
    noiseReductionDb = 0.0f;
    ledMode = 1;
    overheatProtectionEnabled = DEFAULT_OVERHEAT_PROTECTION;
    overheatShutdownC = (float)DEFAULT_OVERHEAT_LIMIT_C;
    overheatLockoutActive = false;
    overheatTripTemp = 0.0f;
    overheatTriggeredAt = 0;
    overheatLastReason = "";
    overheatLastTimestamp = "";
    overheatSensorFault = false;
    overheatLatched = false;
    lastTemperatureC = 0.0f;
    lastTemperatureValid = false;

    isStreaming = false;

    saveAudioSettings();

    simplePrintln("Defaults applied. Device will reboot.");
}


void restartI2S() {
    simplePrintln("Restarting I2S with new parameters...");
    bool wasStreaming = isStreaming;


    if (isStreaming) {
        requestStreamStop("I2S restart");
    }


    stopAudioCaptureTask();


    setup_i2s_driver();


    updateHighpassCoeffs();
    maxPacketRate = 0;
    minPacketRate = 0xFFFFFFFF;

    if (!i2sDriverOk) {
        simplePrintln("I2S restart failed; audio pipeline remains stopped");
        return;
    }



    if (wasStreaming && rtspClient && rtspClient.connected()) {
        streamClient = &rtspClient;
        isStreaming = true;
        core1OwnsLED = true;
        startAudioCaptureTask();
        simplePrintln("I2S restarted, streaming resumed");
    } else {
        isStreaming = false;
        streamClient = NULL;
        startAudioCaptureTask();
        simplePrintln("I2S restarted, diagnostics resumed");
    }
}



static String logTimestamp() {
    time_t now;
    time(&now);
    if (now > 100000) {
        struct tm ti;
        localtime_r(&now, &ti);
        char buf[24];
        strftime(buf, sizeof(buf), "[%H:%M:%S] ", &ti);
        return String(buf);
    }

    unsigned long s = (millis() - bootTime) / 1000;
    unsigned long h = s / 3600; s %= 3600;
    unsigned long m = s / 60; s %= 60;
    char buf[16];
    snprintf(buf, sizeof(buf), "[%02lu:%02lu:%02lu] ", h, m, s);
    return String(buf);
}

void simplePrint(String message) {
    Serial.print(logTimestamp() + message);
}

