matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
void simplePrintln(String message) {
    String stamped = logTimestamp() + message;
    Serial.println(stamped);
    webui_pushLog(stamped);
}

static void resumeRtspServerAfterOtaFailure() {
    if (overheatLatched) {
        rtspServerEnabled = false;
        rtspServer.stop();
        return;
    }
    if (!rtspServerEnabled) return;
    rtspServer.stop();
    delay(20);
    rtspServer.begin();
    rtspServer.setNoDelay(true);
}

static void setupArduinoOta() {
    ArduinoOTA.setHostname(networkHostname.c_str());
    ArduinoOTA.setPort(OTA_PORT);

    ArduinoOTA.onStart([]() {
        const char* updateType = (ArduinoOTA.getCommand() == U_FLASH) ? "firmware" : "filesystem";
        simplePrintln(String("OTA start: ") + updateType + " update requested");
        otaPreviousRtspEnabled = rtspServerEnabled;
        if (isStreaming) {
            requestStreamStop("OTA update");
        }
        stopAudioCaptureTask();
        rtspServer.stop();
        rtspServerEnabled = false;
        core1OwnsLED = false;
        setStatusLed(CRGB(128, 0, 128));
    });

    ArduinoOTA.onEnd([]() {
        simplePrintln("OTA update complete, rebooting");
        setStatusLed(CRGB(0, 128, 0));
    });

    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        static uint8_t lastPercent = 255;
        uint8_t percent = total ? (progress * 100U) / total : 0;
        if (percent != lastPercent && (percent == 0 || percent == 100 || (percent % 10) == 0)) {
            simplePrintln("OTA progress: " + String(percent) + "%");
            lastPercent = percent;
        }
    });

    ArduinoOTA.onError([](ota_error_t error) {
        String reason = "unknown";
        switch (error) {
            case OTA_AUTH_ERROR: reason = "auth failed"; break;
            case OTA_BEGIN_ERROR: reason = "begin failed"; break;
            case OTA_CONNECT_ERROR: reason = "connect failed"; break;
            case OTA_RECEIVE_ERROR: reason = "receive failed"; break;
            case OTA_END_ERROR: reason = "end failed"; break;
            default: break;
        }
        simplePrintln("OTA error: " + reason);
        if (i2sDriverOk) {
            startAudioCaptureTask();
        }
        rtspServerEnabled = otaPreviousRtspEnabled;
        resumeRtspServerAfterOtaFailure();
        if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
        else setStatusLed(CRGB(0, 0, 0));
    });

    ArduinoOTA.begin();
    simplePrintln("OTA ready: pio run -e m5stack-atoms3-lite-ota -t upload");
    simplePrintln("OTA target: " + networkHostname + ".local:" + String(OTA_PORT));
}



void drainRtspReceiveBuffer(WiFiClient &client) {
    if (!client || !client.connected()) return;
    int drained = 0;
    while (client.available() > 0 && drained < 4096) {
        uint8_t buf[256];
        int n = client.read(buf, sizeof(buf));
        if (n <= 0) break;
        drained += n;
    }
    if (drained > 0) {
        simplePrintln("Drained " + String(drained) + " bytes from RTSP receive buffer");
    }
}


static void updateFftFromBlock(const int16_t* samples, uint16_t count) {
    const int N = 128;
    const int BINS = 32;
    if (!samples || count < N) return;

    float mean = 0.0f;
    for (int i = 0; i < N; i++) mean += (float)samples[i];
    mean /= (float)N;

    float mags[BINS];
    float maxMag = 0.0f;
    for (int k = 0; k < BINS; k++) {
        float re = 0.0f;
        float im = 0.0f;
        for (int n = 0; n < N; n++) {
            float x = ((float)samples[n] - mean) * (0.5f - 0.5f * cosf((2.0f * PI * (float)n) / (float)(N - 1)));
            float phase = 2.0f * PI * (float)k * (float)n / (float)N;
            re += x * cosf(phase);
            im -= x * sinf(phase);
        }
        float mag = sqrtf(re * re + im * im);
        mag *= (1.0f + 0.01f * (float)k);
        mags[k] = mag;
        if (mag > maxMag) maxMag = mag;
    }

    if (maxMag < 1.0f) maxMag = 1.0f;
    for (int k = 0; k < BINS; k++) {
        float norm = mags[k] / maxMag;
        if (norm < 0.0f) norm = 0.0f;
        if (norm > 1.0f) norm = 1.0f;
        fftBins[k] = (uint8_t)(norm * 255.0f);
    }
    fftFrameSeq++;
}





void audioCaptureTask(void* parameter) {
    Serial.println("[Core1] Audio pipeline task started");
    audioTaskRunning = true;

    size_t bytesRead = 0;
    uint32_t consecutiveErrors = 0;
    const uint32_t MAX_ERRORS = 10;
    uint32_t packetCount = 0;

    const uint16_t chunkSamples = effectiveAudioChunkSize();
    const uint16_t readBufferSamples = computeI2sReadBufferSamples();
    int16_t* captureBuffer = (int16_t*)malloc(readBufferSamples * sizeof(int16_t));
    int16_t* outputBuffer = (int16_t*)malloc(readBufferSamples * sizeof(int16_t));

    if (!captureBuffer || !outputBuffer) {
        Serial.println("[Core1] FATAL: Failed to allocate audio buffers!");
        if (captureBuffer) free(captureBuffer);
        if (outputBuffer) free(outputBuffer);
        audioTaskRunning = false;
        vTaskDelete(NULL);
        return;
    }


    Biquad localHpf = hpf;
    uint32_t localHpfConfigSampleRate = hpfConfigSampleRate;
    uint16_t localHpfConfigCutoff = hpfConfigCutoff;


    float localAgcMult = 1.0f;
    float localLimiterGain = 1.0f;
    float localNoiseFloor = NOISE_FLOOR_INIT;
    float localNoiseGate = max(NOISE_GATE_MIN, localNoiseFloor * NOISE_GATE_RATIO + NOISE_GATE_MARGIN);
    float localNoiseGain = 1.0f;
    float localNoiseEnv = 0.0f;
    uint32_t localNoiseGateHoldSamples = 0;
    float localNoiseReduction = 0.0f;
    const float LIMITER_TARGET_PEAK = 26000.0f;
    const float LIMITER_RELEASE = 0.02f;
    const float LIMITER_MIN_GAIN = 0.20f;

    uint32_t i2sErrors = 0;
    unsigned long lastStatsLog = millis();
    unsigned long lastLedUpdate = 0;
    unsigned long lastGoodCaptureMs = millis();
    int16_t lastOutputSample = 0;
    char streamingRtspBuf[512];
    size_t streamingRtspBufPos = 0;
    uint16_t streamingInterleavedDiscard = 0;
    const TickType_t readTimeoutTicks = pdMS_TO_TICKS(max(20UL, min(200UL,
        ((unsigned long)readBufferSamples * 1000UL) / max((uint32_t)1, currentSampleRate) + 10UL)));

    while (audioTaskRunning) {

        if (stopStreamRequested) {
            WiFiClient* client = streamClient;
            if (client) {
                client->stop();
            }
            rtpUdp.stop();
            streamClient = NULL;
            isStreaming = false;
            core1OwnsLED = false;
            streamCleanupDone = true;
            __asm__ __volatile__("memw" ::: "memory");

            while (stopStreamRequested && audioTaskRunning) {
                vTaskDelay(pdMS_TO_TICKS(10));
            }
            continue;
        }



        WiFiClient* client = streamClient;
        bool streamActive = (isStreaming && client != NULL);


        if (millis() - lastStatsLog > 30000) {
            Serial.printf("[Core1] Sent=%u I2Serr=%u Clip=%lu AGC=%.2f RawPeak=%u RawRMS=%u RawMin=%d RawMax=%d Z=%u%%\n",
                         packetCount, i2sErrors, audioClipCount, localAgcMult,
                         i2sLastRawPeakAbs, i2sLastRawRms, i2sLastRawMin, i2sLastRawMax, i2sLastRawZeroPct);
            lastStatsLog = millis();
        }


        esp_err_t result = i2s_read(I2S_NUM_0, captureBuffer,
                                    readBufferSamples * sizeof(int16_t),
                                    &bytesRead, readTimeoutTicks);
        unsigned long processStartUs = micros();

        if (result != ESP_OK || bytesRead == 0) {
            if (result != ESP_OK) {
                consecutiveErrors++;
                i2sErrors++;
                i2sReadErrCount++;
                if (consecutiveErrors >= MAX_ERRORS) {
                    Serial.println("[Core1] Too many I2S errors, pausing");
                    vTaskDelay(pdMS_TO_TICKS(100));
                    consecutiveErrors = 0;
                }
            } else {
                i2sReadZeroCount++;
            }

            if (streamActive) {
                audioFallbackBlockCount++;
                i2sLastGapMs = millis() - lastGoodCaptureMs;
                fillConcealmentBlock(outputBuffer, chunkSamples, lastOutputSample);
                lastOutputSample = outputBuffer[chunkSamples - 1];
                lastPeakAbs16 = (uint16_t)abs((int)outputBuffer[0]);
                audioClippedLastBlock = false;
                sendRTPPacket(*client, outputBuffer, chunkSamples);
                packetCount++;

                float blockMs = (1000.0f * (float)chunkSamples) / max((float)currentSampleRate, 1.0f);
                float workMs = (float)(micros() - processStartUs) / 1000.0f;
                float instLoad = (blockMs > 0.0f) ? (workMs * 100.0f / blockMs) : 0.0f;
                if (instLoad > 100.0f) instLoad = 100.0f;
                audioPipelineLoadPct += (instLoad - audioPipelineLoadPct) * 0.20f;
            }
            continue;
        }

        consecutiveErrors = 0;
        i2sReadOkCount++;
        lastGoodCaptureMs = millis();
        i2sLastGapMs = 0;
        uint16_t samplesRead = bytesRead / sizeof(int16_t);
        i2sLastSamplesRead = samplesRead;


