matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
                float pct = peakAbs / 32767.0f;
                if (clipped) {
                    setStatusLed(CRGB(255, 0, 0));
                } else if (pct > 0.7f) {
                    setStatusLed(CRGB(255, 165, 0));
                } else if (pct > 0.3f) {
                    setStatusLed(CRGB(0, 255, 0));
                } else if (pct > 0.05f) {
                    setStatusLed(CRGB(0, 64, 0));
                } else {
                    setStatusLed(CRGB(32, 0, 32));
                }
            } else if (ledMode == 1) {

                setStatusLed(CRGB(0, 128, 0));
            } else {

                setStatusLed(CRGB(0, 0, 0));
            }
            lastLedUpdate = millis();
        }

        if (streamActive) {

            sendRTPPacket(*client, outputBuffer, samplesRead);
            packetCount++;
        }

        float blockMs = (1000.0f * (float)max((uint16_t)1, samplesRead)) / max((float)currentSampleRate, 1.0f);
        float workMs = (float)(micros() - processStartUs) / 1000.0f;
        float instLoad = (blockMs > 0.0f) ? (workMs * 100.0f / blockMs) : 0.0f;
        if (instLoad > 100.0f) instLoad = 100.0f;
        audioPipelineLoadPct += (instLoad - audioPipelineLoadPct) * 0.15f;



        static unsigned long lastRtspCheck = 0;
        if (streamActive && (millis() - lastRtspCheck > 50)) {
            lastRtspCheck = millis();
            pollStreamingRtspCommands(*client, streamingRtspBuf, sizeof(streamingRtspBuf),
                                      streamingRtspBufPos, streamingInterleavedDiscard);
        }

        taskYIELD();
    }

    free(captureBuffer);
    free(outputBuffer);
    core1OwnsLED = false;
    audioTaskRunning = false;
    Serial.println("[Core1] Audio pipeline task stopped");
    xSemaphoreGive(taskExitSemaphore);
    vTaskDelete(NULL);
}


void startAudioCaptureTask() {
    if (audioCaptureTaskHandle != NULL) {

        return;
    }

    BaseType_t result = xTaskCreatePinnedToCore(
        audioCaptureTask,
        "AudioPipeline",
        8192,
        NULL,
        10,
        &audioCaptureTaskHandle,
        1
    );

    if (result != pdPASS) {
        simplePrintln("[Core1] FATAL: Failed to create audio pipeline task!");
    }
}


void stopAudioCaptureTask() {
    if (audioCaptureTaskHandle != NULL) {
        audioTaskRunning = false;

        if (xSemaphoreTake(taskExitSemaphore, pdMS_TO_TICKS(2000)) != pdTRUE) {
            Serial.println("[Core0] WARNING: Audio task did not exit within 2s");
        }
        audioCaptureTaskHandle = NULL;
    }
}




bool requestStreamStop(const char* reason) {

    if (!isStreaming && streamClient == NULL) return true;

    Serial.printf("[Core0] requestStreamStop: %s\n", reason);


    stopStreamRequested = true;
    __asm__ __volatile__("memw" ::: "memory");


    unsigned long deadline = millis() + 3000;
    while (!streamCleanupDone && millis() < deadline) {
        vTaskDelay(pdMS_TO_TICKS(10));
    }

    if (streamCleanupDone) {

        isStreaming = false;
        streamClient = NULL;
        stopStreamRequested = false;
        streamCleanupDone = false;
        Serial.printf("[Core0] Stream stopped cleanly: %s\n", reason);
        return true;
    } else {

        Serial.printf("[Core0] WARNING: Stream stop timeout, forcing cleanup: %s\n", reason);
        isStreaming = false;
        streamClient = NULL;
        stopStreamRequested = false;
        streamCleanupDone = false;
        core1OwnsLED = false;
        return false;
    }
}


void setup_i2s_driver() {
    i2sDriverOk = false;
    i2sLastError = ESP_OK;

    esp_err_t err = i2s_driver_uninstall(I2S_NUM_0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) {
        simplePrintln("WARNING: I2S uninstall returned " + String(esp_err_to_name(err)));
    }

    const uint16_t dma_buf_len = computeI2sDmaBufferLen();
    const uint8_t dma_buf_count = computeI2sDmaBufferCount();

    i2s_config_t i2s_config = {

        .mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM),
        .sample_rate = currentSampleRate,
        .bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT,
        .channel_format = I2S_CHANNEL_FMT_ONLY_RIGHT,
#if ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 1, 0)
        .communication_format = I2S_COMM_FORMAT_STAND_I2S,
#else
        .communication_format = I2S_COMM_FORMAT_I2S,
#endif
        .intr_alloc_flags = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count = dma_buf_count,
        .dma_buf_len = dma_buf_len,
        .use_apll = false,
        .tx_desc_auto_clear = false,
        .fixed_mclk = 0
    };

    i2s_pin_config_t pin_config = {
#if (ESP_IDF_VERSION > ESP_IDF_VERSION_VAL(4, 3, 0))
        .mck_io_num = I2S_PIN_NO_CHANGE,
#endif
        .bck_io_num = I2S_PIN_NO_CHANGE,
        .ws_io_num = I2S_CLK_PIN,
        .data_out_num = I2S_PIN_NO_CHANGE,
        .data_in_num = I2S_DATA_IN_PIN
    };

    err = i2s_driver_install(I2S_NUM_0, &i2s_config, 0, NULL);
    if (err != ESP_OK) {
        i2sLastError = err;
        simplePrintln("ERROR: I2S driver_install failed: " + String(esp_err_to_name(err)));
        return;
    }

    err = i2s_set_pin(I2S_NUM_0, &pin_config);
    if (err != ESP_OK) {
        i2sLastError = err;
        simplePrintln("ERROR: I2S set_pin failed: " + String(esp_err_to_name(err)));
        i2s_driver_uninstall(I2S_NUM_0);
        return;
    }

    err = i2s_set_clk(I2S_NUM_0, currentSampleRate, I2S_BITS_PER_SAMPLE_16BIT, I2S_CHANNEL_MONO);
    if (err != ESP_OK) {
        i2sLastError = err;
        simplePrintln("ERROR: I2S set_clk failed: " + String(esp_err_to_name(err)));
        i2s_driver_uninstall(I2S_NUM_0);
        return;
    }

    i2sDriverOk = true;
    i2sLastError = ESP_OK;
    simplePrintln("I2S ready (PDM mode): " + String(currentSampleRate) + "Hz, gain " +
                  String(currentGainFactor, 1) + ", buffer " + String(currentBufferSize) +
                  " (chunk " + String(effectiveAudioChunkSize()) + ")" +
                  ", dma " + String(dma_buf_count) + "x" + String(dma_buf_len) +
                  ", read " + String(computeI2sReadBufferSamples()) +
                  ", shiftBits " + String(i2sShiftBits));
}

static bool writeAll(WiFiClient &client, const uint8_t* data, size_t len, unsigned long timeoutMs) {
    size_t off = 0;
    unsigned long startTime = millis();

    while (off < len) {

