matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
        if (millis() - startTime > timeoutMs) {

            return false;
        }

        int w = client.write(data + off, len - off);
        if (w <= 0) return false;
        off += (size_t)w;
    }
    return true;
}

static int parseRtspCSeqValue(const char* request) {
    if (!request) return 1;
    const char* cseqStr = strstr(request, "CSeq:");
    if (!cseqStr) cseqStr = strstr(request, "Cseq:");
    if (!cseqStr) cseqStr = strstr(request, "cseq:");
    if (!cseqStr) return 1;
    cseqStr += 5;
    while (*cseqStr == ' ' || *cseqStr == '\t') cseqStr++;
    int cseqVal = atoi(cseqStr);
    return (cseqVal > 0) ? cseqVal : 1;
}

static uint16_t parseRtspContentLengthValue(const char* request) {
    if (!request) return 0;
    const char* lenStr = strstr(request, "Content-Length:");
    if (!lenStr) lenStr = strstr(request, "Content-length:");
    if (!lenStr) lenStr = strstr(request, "content-length:");
    if (!lenStr) return 0;
    lenStr += 15;
    while (*lenStr == ' ' || *lenStr == '\t') lenStr++;
    long len = atol(lenStr);
    if (len <= 0) return 0;
    if (len > 2048) return 2048;
    return (uint16_t)len;
}

static bool writeRtspSimpleResponse(WiFiClient &client, int cseqVal, const char* extraHeaders) {
    char resp[256];
    int rlen = snprintf(resp, sizeof(resp),
                        "RTSP/1.0 200 OK\r\n"
                        "CSeq: %d\r\n"
                        "Session: %s\r\n"
                        "Connection: keep-alive\r\n"
                        "%s"
                        "\r\n",
                        cseqVal,
                        rtspSessionId.length() ? rtspSessionId.c_str() : "1",
                        extraHeaders ? extraHeaders : "");
    if (rlen <= 0) return false;
    if (rlen >= (int)sizeof(resp)) rlen = (int)sizeof(resp) - 1;
    return writeAll(client, (const uint8_t*)resp, (size_t)rlen, 80);
}

static bool handleStreamingRtspCommand(WiFiClient &client, const char* request) {
    if (!request || request[0] == '\0') return true;




    int cseqVal = parseRtspCSeqValue(request);
    if (strstr(request, "TEARDOWN") != NULL) {
        writeRtspSimpleResponse(client, cseqVal);
        client.stop();
        rtpUdp.stop();
        streamClient = NULL;
        isStreaming = false;
        core1OwnsLED = false;
        Serial.println("[Core1] TEARDOWN received, stream stopped");
        return false;
    }

    if (strstr(request, "GET_PARAMETER") != NULL) {
        writeRtspSimpleResponse(client, cseqVal);
        lastRTSPActivity = millis();
    } else if (strstr(request, "OPTIONS") != NULL) {
        writeRtspSimpleResponse(client, cseqVal,
            "Public: OPTIONS, DESCRIBE, SETUP, PLAY, TEARDOWN, GET_PARAMETER, SET_PARAMETER\r\n");
        lastRTSPActivity = millis();
    } else if (strstr(request, "SET_PARAMETER") != NULL) {
        writeRtspSimpleResponse(client, cseqVal);
        lastRTSPActivity = millis();
    }

    return true;
}

static void pollStreamingRtspCommands(WiFiClient &client, char* rtspBuf, size_t rtspBufSize,
                                      size_t &rtspBufPos, uint16_t &interleavedDiscardRemaining) {
    if (!rtspBuf || rtspBufSize < 8) return;

    uint8_t discardBuf[64];
    while (client.connected() && client.available() > 0) {
        if (interleavedDiscardRemaining > 0) {
            int toRead = min((int)sizeof(discardBuf), min(client.available(), (int)interleavedDiscardRemaining));
            int n = client.read(discardBuf, toRead);
            if (n <= 0) return;
            interleavedDiscardRemaining -= (uint16_t)n;
            continue;
        }

        if (rtspBufPos == 0 && client.peek() == '$') {
            if (client.available() < 4) return;
            uint8_t hdr[4];
            int n = client.read(hdr, sizeof(hdr));
            if (n != (int)sizeof(hdr)) return;
            interleavedDiscardRemaining = ((uint16_t)hdr[2] << 8) | (uint16_t)hdr[3];
            continue;
        }

        int c = client.read();
        if (c < 0) return;

        if (rtspBufPos >= rtspBufSize - 1) {
            rtspBufPos = 0;
            rtspBuf[0] = '\0';
            Serial.println("[Core1] Streaming RTSP buffer overflow, reset parser");
            return;
        }

        rtspBuf[rtspBufPos++] = (char)c;
        rtspBuf[rtspBufPos] = '\0';

        if (rtspBufPos >= 4 &&
            rtspBuf[rtspBufPos - 4] == '\r' &&
            rtspBuf[rtspBufPos - 3] == '\n' &&
            rtspBuf[rtspBufPos - 2] == '\r' &&
            rtspBuf[rtspBufPos - 1] == '\n') {
            rtspBuf[rtspBufPos - 4] = '\0';
            uint16_t bodyBytes = parseRtspContentLengthValue(rtspBuf);
            bool keepOpen = handleStreamingRtspCommand(client, rtspBuf);
            rtspBufPos = 0;
            rtspBuf[0] = '\0';
            if (bodyBytes > 0) {
                interleavedDiscardRemaining = bodyBytes;
            }
            if (!keepOpen) return;
        }
    }
}

static uint32_t consecutiveWriteFailures = 0;
static const uint32_t MAX_WRITE_FAILURES = 100;

void sendRTPPacket(WiFiClient &client, int16_t* audioData, int numSamples) {
    if (!client.connected()) {

        client.stop();
        rtpUdp.stop();
        streamClient = NULL;
        isStreaming = false;
        core1OwnsLED = false;
        return;
    }

    const int maxSamplesPerPacket = (int)effectiveAudioChunkSize();
    int offsetSamples = 0;
    while (offsetSamples < numSamples) {
        const int packetSamples = min(maxSamplesPerPacket, numSamples - offsetSamples);
        const uint16_t payloadSize = (uint16_t)(packetSamples * (int)sizeof(int16_t));
        const uint16_t packetSize = (uint16_t)(12 + payloadSize);
        const unsigned long packetWindowMs = max(40UL, min(140UL, (unsigned long)(((uint32_t)packetSamples * 1000UL) / max((uint32_t)1, currentSampleRate)) * 2UL));
        uint8_t packetBuffer[12 + (1024 * sizeof(int16_t))];


        packetBuffer[0] = 0x80;
        packetBuffer[1] = 96;
        packetBuffer[2] = (uint8_t)((rtpSequence >> 8) & 0xFF);
        packetBuffer[3] = (uint8_t)(rtpSequence & 0xFF);
        packetBuffer[4] = (uint8_t)((rtpTimestamp >> 24) & 0xFF);
        packetBuffer[5] = (uint8_t)((rtpTimestamp >> 16) & 0xFF);
        packetBuffer[6] = (uint8_t)((rtpTimestamp >> 8) & 0xFF);
        packetBuffer[7] = (uint8_t)(rtpTimestamp & 0xFF);
        packetBuffer[8] = (uint8_t)((rtpSSRC >> 24) & 0xFF);
        packetBuffer[9] = (uint8_t)((rtpSSRC >> 16) & 0xFF);
        packetBuffer[10] = (uint8_t)((rtpSSRC >> 8) & 0xFF);
        packetBuffer[11] = (uint8_t)(rtpSSRC & 0xFF);

        const int16_t* packetAudio = audioData + offsetSamples;

