matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
        String playUrl = "rtsp://" + WiFi.localIP().toString() + ":8554/audio/track1";
        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n");
        client.print("Session: " + rtspSessionId + "\r\n");
        client.print("Range: npt=0.000-\r\n");
        client.print("RTP-Info: url=" + playUrl + ";seq=0;rtptime=0\r\n\r\n");


        stopStreamRequested = false;
        streamCleanupDone = false;
        core1OwnsLED = true;
        __asm__ __volatile__("memw" ::: "memory");


        streamClient = &rtspClient;
        isStreaming = true;


        startAudioCaptureTask();


        simplePrintln("STREAMING STARTED via " + String(rtspTransportModeName(activeRtspTransport)));

    } else if (request.startsWith("TEARDOWN")) {

        if (isStreaming) {
            requestStreamStop("TEARDOWN");
        }


        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n");
        client.print("Session: " + rtspSessionId + "\r\n\r\n");

        if (!core1OwnsLED) {
            if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
            else setStatusLed(CRGB(0, 0, 0));
        }
        simplePrintln("STREAMING STOPPED");
    } else if (request.startsWith("GET_PARAMETER")) {

        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n\r\n");
    } else if (request.startsWith("SET_PARAMETER")) {
        client.print("RTSP/1.0 200 OK\r\n");
        client.print("CSeq: " + cseq + "\r\n\r\n");
    }
}


void processRTSP(WiFiClient &client) {
    if (!client.connected()) return;

    if (client.available()) {
        int available = client.available();
        int spaceLeft = sizeof(rtspParseBuffer) - rtspParseBufferPos - 1;

        if (available > spaceLeft) {
            available = spaceLeft;
        }

        if (available <= 0) {
            static unsigned long lastOverflowWarning = 0;
            if (millis() - lastOverflowWarning > 5000) {
                simplePrintln("RTSP buffer full - resetting");
                lastOverflowWarning = millis();
            }
            rtspParseBufferPos = 0;
            return;
        }

        client.read(rtspParseBuffer + rtspParseBufferPos, available);
        rtspParseBufferPos += available;
        rtspParseBuffer[rtspParseBufferPos] = '\0';

        char* endOfHeader = strstr((char*)rtspParseBuffer, "\r\n\r\n");
        if (endOfHeader != nullptr) {
            *endOfHeader = '\0';
            String request = String((char*)rtspParseBuffer);

            handleRTSPCommand(client, request);

            int headerLen = (endOfHeader - (char*)rtspParseBuffer) + 4;
            int remaining = rtspParseBufferPos - headerLen;
            if (remaining > 0) {
                memmove(rtspParseBuffer, rtspParseBuffer + headerLen, remaining);
            }
            rtspParseBufferPos = remaining;
        }
    }
}

static void rejectBusyRtspClient(WiFiClient &client) {
    if (!client) return;
    client.setNoDelay(true);

    char req[256];
    int n = 0;
    unsigned long deadline = millis() + 120UL;
    while (client.connected() && client.available() == 0 && millis() < deadline) {
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    if (client.available() > 0) {
        int avail = client.available();
        if (avail > (int)sizeof(req) - 1) avail = sizeof(req) - 1;
        n = client.read((uint8_t*)req, avail);
    }
    if (n < 0) n = 0;
    req[n] = '\0';

    char cseq[16] = "1";
    const char* cseqStart = strstr(req, "CSeq:");
    if (cseqStart) {
        cseqStart += 5;
        while (*cseqStart == ' ' || *cseqStart == '\t') cseqStart++;
        size_t i = 0;
        while (i < sizeof(cseq) - 1 && cseqStart[i] >= '0' && cseqStart[i] <= '9') {
            cseq[i] = cseqStart[i];
            i++;
        }
        cseq[i] = '\0';
        if (i == 0) strcpy(cseq, "1");
    }

    char resp[160];
    int len = snprintf(resp, sizeof(resp),
                       "RTSP/1.0 453 Not Enough Bandwidth\r\n"
                       "CSeq: %s\r\n"
                       "Connection: close\r\n\r\n",
                       cseq);
    if (len > 0) {
        client.write((const uint8_t*)resp, (size_t)len);
    }
    delay(5);
    client.stop();
    simplePrintln("Rejected extra RTSP client while stream is busy");
}




void setup() {
    FastLED.addLeds<WS2812, WS2812_LED_PIN, GRB>(statusLed, 1);
    FastLED.setBrightness(32);
    setStatusLed(CRGB(0, 0, 0));

    Serial.begin(115200);
    delay(500);
    Serial.println("\n\n=== ESP32 RTSP Mic Starting ===");
    Serial.println("Board: M5Stack AtomS3 Lite");


    taskExitSemaphore = xSemaphoreCreateBinary();


    setStatusLed(CRGB(128, 128, 0));


    randomSeed((uint32_t)micros() ^ (uint32_t)(ESP.getEfuseMac() & 0xFFFFFFFF));
    for (uint16_t i = 0; i < TELEMETRY_HISTORY_LEN; ++i) {
        telemetryTempDeciC[i] = INT16_MIN;
    }

    bootTime = millis();
    rtpSSRC = (uint32_t)random(1, 0x7FFFFFFF);
    Serial.println("Random seed initialized");
# 2138 "/Users/mattie/Documents/PlatformIO/Projects/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino"
    Serial.println("Loading settings...");
    loadAudioSettings();
    Serial.println("Settings loaded");


    Serial.println("Audio buffers will be allocated by Core 1 pipeline task");


    Serial.println("Initializing WiFi...");
    WiFi.setSleep(false);

    WiFi.setHostname(DEFAULT_NETWORK_HOSTNAME);

    WiFiManager wm;
    wm.setConnectTimeout(60);
    wm.setConfigPortalTimeout(180);
    if (!wm.autoConnect("ESP32-RTSP-Mic-AP")) {
        simplePrintln("WiFi failed, restarting...");
        ESP.restart();
    }

    simplePrintln("WiFi connected: " + WiFi.localIP().toString());


    configTime(-5 * 3600, 0, "pool.ntp.org");
    Serial.print("Waiting for NTP time sync...");
    time_t now = 0;
    for (int i = 0; i < 20 && now < 100000; i++) {
        delay(250);
        time(&now);
    }
    if (now > 100000) {
        struct tm ti;
        localtime_r(&now, &ti);
        char buf[32];
        strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &ti);
        Serial.printf(" OK: %s EST\n", buf);
    } else {
        Serial.println(" failed (will use uptime)");
    }


    applyWifiTxPower(true);

    const char* wifiHostname = WiFi.getHostname();
    if (wifiHostname && wifiHostname[0] != '\0') {
        networkHostname = String(wifiHostname);
    }


    if (MDNS.begin(networkHostname.c_str())) {
        MDNS.addService("rtsp", "tcp", 8554);
        MDNS.addService("http", "tcp", 80);
        MDNS.addService("arduino", "tcp", OTA_PORT);
        simplePrintln("mDNS: " + networkHostname + ".local");
    }

    setupArduinoOta();

    Serial.println("Setting up I2S driver...");
    setup_i2s_driver();
    if (i2sDriverOk) {
        Serial.println("I2S driver ready");

