matthew73210/birdnetgo-m5stack-atom-echo-rtsp-mic/src/esp32_rtsp_mic_birdnetgo.ino.cpp
        startAudioCaptureTask();
        Serial.println("Dual-core audio ready (Core 1 pipeline running for always-on diagnostics)");
    } else {
        Serial.printf("I2S driver setup failed, audio pipeline not started (err=%ld)\n", (long)i2sLastError);
    }

    Serial.println("Updating highpass coefficients...");
    updateHighpassCoeffs();
    Serial.println("Highpass coefficients updated");

    if (!overheatLatched) {
        rtspServer.begin();
        rtspServer.setNoDelay(true);
        rtspServerEnabled = true;
    } else {
        rtspServerEnabled = false;
        rtspServer.stop();
    }

    webui_begin();

    lastStatsReset = millis();
    lastRTSPActivity = millis();
    lastMemoryCheck = millis();
    lastPerformanceCheck = millis();
    lastWiFiCheck = millis();
    minFreeHeap = ESP.getFreeHeap();
    float initialTemp = temperatureRead();
    if (isTemperatureValid(initialTemp)) {
        maxTemperature = initialTemp;
        lastTemperatureC = initialTemp;
        lastTemperatureValid = true;
        overheatSensorFault = false;
    } else {
        maxTemperature = 0.0f;
        lastTemperatureC = 0.0f;
        lastTemperatureValid = false;
        overheatSensorFault = true;
        overheatLastReason = "Thermal protection disabled: temperature sensor unavailable.";
        overheatLastTimestamp = "";
        overheatTripTemp = 0.0f;
        overheatTriggeredAt = 0;
        persistOverheatNote();
        simplePrintln("WARNING: Temperature sensor unavailable at startup. Thermal protection paused.");
    }

    setCpuFrequencyMhz(cpuFrequencyMhz);
    simplePrintln("CPU frequency set to " + String(cpuFrequencyMhz) + " MHz for optimal thermal/performance balance");

    if (!overheatLatched) {
        simplePrintln("RTSP server ready on port 8554");
        simplePrintln("RTSP URL: rtsp://" + WiFi.localIP().toString() + ":8554/audio");
        simplePrintln("RTSP URL: rtsp://" + networkHostname + ".local:8554/audio");

        if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
        else setStatusLed(CRGB(0, 0, 0));
    } else {
        simplePrintln("RTSP server paused due to thermal latch. Clear via Web UI before resuming streaming.");

        setStatusLed(CRGB(128, 0, 0));
    }
    simplePrintln("Web UI: http://" + WiFi.localIP().toString() + "/");
}

void loop() {
    webui_handleClient();
    ArduinoOTA.handle();

    if (millis() - lastTempCheck > 5000) {
        checkTemperature();
        lastTempCheck = millis();
    }

    if (millis() - lastTelemetrySampleMs > 3000) {
        recordTelemetrySample(audioPipelineLoadPct, lastTemperatureC, lastTemperatureValid);
        lastTelemetrySampleMs = millis();
    }


    if (millis() - lastMemoryCheck > 600000) {
        uint32_t currentHeap = ESP.getFreeHeap();
        if (currentHeap < minFreeHeap) minFreeHeap = currentHeap;
        Serial.printf("[Heap] Current: %u KB, Min: %u KB\n", currentHeap / 1024, minFreeHeap / 1024);
        lastMemoryCheck = millis();
    }

    if (millis() - lastPerformanceCheck > (performanceCheckInterval * 60000UL)) {
        checkPerformance();
        lastPerformanceCheck = millis();
    }

    if (millis() - lastWiFiCheck > 30000) {
        checkWiFiHealth();
        lastWiFiCheck = millis();
    }

    checkScheduledReset();


    if (rtspClient && rtspClient.connected() && !isStreaming) {
        if (millis() - lastRTSPActivity > 60000) {
            simplePrintln("RTSP idle timeout — disconnecting");
            rtspClient.stop();
            rtpUdp.stop();
            rtspParseBufferPos = 0;
        }
    }


    static bool wasStreaming = false;
    if (rtspServerEnabled) {

        if (wasStreaming && !isStreaming) {

            if (!core1OwnsLED) {
                if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
                else setStatusLed(CRGB(0, 0, 0));
            }
            unsigned long sessionSec = (millis() - lastRtspPlayMs) / 1000;
            simplePrintln("RTSP client disconnected (session: " + String(sessionSec) + "s, dropped: " +
                         String(audioPacketsDropped) + ", RSSI: " + String(WiFi.RSSI()) + " dBm)");
        }
        wasStreaming = isStreaming;

        if (isStreaming) {


            WiFiClient extraClient = rtspServer.available();
            if (extraClient) {
                rejectBusyRtspClient(extraClient);
            }
        } else {

            if (!rtspClient || !rtspClient.connected()) {
                WiFiClient newClient = rtspServer.available();
                if (newClient) {
                    rtspClient = newClient;
                    rtspClient.setNoDelay(true);
                    rtspParseBufferPos = 0;
                    lastRTSPActivity = millis();
                    lastRtspClientConnectMs = millis();
                    rtspConnectCount++;
                    simplePrintln("New RTSP client connected");
                }
            }


            if (rtspClient && rtspClient.connected()) {
                processRTSP(rtspClient);
            }
        }
    } else {

        if (isStreaming) {
            requestStreamStop("server disabled");
            stopAudioCaptureTask();
        }
        if (!core1OwnsLED) {
            if (overheatLatched) {
                setStatusLed(CRGB(128, 0, 0));
            } else {
                if (ledMode > 0) setStatusLed(CRGB(0, 0, 128));
                else setStatusLed(CRGB(0, 0, 0));
            }
        }
    }

    if (scheduledRebootAt != 0 && millis() >= scheduledRebootAt) {
        if (scheduledFactoryReset) {
            resetToDefaultSettings();
        }
        delay(50);
        ESP.restart();
    }
}